Конфиг21/src/Documents/ЗакрытиеМесяца/ЗакрытиеМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеМесяца</name>
  <registerRecords>AccountingRegister.РегистрБухУчет</registerRecords>
</mdclass:Document>

Конфиг21/src/AccountingRegisters/РегистрБухУчет/РегистрБухУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБухУчет</name>
  <chartOfAccounts>ChartOfAccounts.БухгалтерскийУчет</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

Конфиг21/src/ChartsOfAccounts/БухгалтерскийУчет/БухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>БухгалтерскийУчет</name>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>01</code>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>01.1</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>01.2</code>
      </childItems>
      <childItems>
        <name>РасчетныйСчет</name>
        <description>Расчетный счет</description>
        <code>01.3</code>
      </childItems>
      <childItems>
        <name>Себестоимость</name>
        <description>Себестоимость</description>
        <code>01.4</code>
      </childItems>
    </items>
    <items>
      <name>Пассивы</name>
      <description>Пассивы</description>
      <code>02</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>02.1</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>02.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

Конфиг21/src/Documents/ЗакрытиеМесяца/ObjectModule.bsl
Функция ОстатокПоСчету(Счет, Период)
	      	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрБухУчетОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
		|	РегистрБухУчетОстатки.СуммаОстатокКт КАК СуммаОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.РегистрБухУчет.Остатки(&Период, Счет = &Счет, ) КАК РегистрБухУчетОстатки";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Счет", Счет);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
		КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	 ВыборкаДетальныеЗаписи.Следующий()	
	 Если Счет.Вид = ВидСчета.Активный Тогда
		 Возврат ВыборкаДетальныеЗаписи.СуммаОстатокДт;
	 Иначе
		  Возврат ВыборкаДетальныеЗаписи.СуммаОстатокКт;
		  КонецЕсли;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	КонецФункции;
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		КонецПериода = КонецМесяца(Дата)+1;
	      ОстатокВыручка = ОстатокПоСчету(ПланыСчетов.БухгалтерскийУчет.Выручка, КонецПериода);
		     ОстатокСебестоимости = ОстатокПоСчету(ПланыСчетов.БухгалтерскийУчет.Себестоимость, КонецПериода);

			 Движения.РегистрБухУчет.Записывать = Истина;
			 
			Проводка = Движения.РегистрБухУчет.Добавить();
			Проводка.Период  = Дата;
			Проводка.СчетДт = ПланыСчетов.БухгалтерскийУчет.Выручка;
			Проводка.СчетКт = ПланыСчетов.БухгалтерскийУчет.Прибыль;
			Проводка.Сумма = ОстатокВыручка;
			
			Проводка = Движения.РегистрБухУчет.Добавить();
			Проводка.Период  = Дата;
			Проводка.СчетДт = ПланыСчетов.БухгалтерскийУчет.Прибыль;
			Проводка.СчетКт = ПланыСчетов.БухгалтерскийУчет.Себестоимость;
			Проводка.Сумма = ОстатокСебестоимости;


КонецПроцедуры
